faris1702/SC2079-STM32-Robot/main.c
	//------------------------- NEW ------------------------------
	if (huart->Instance == USART3){
	  switch (uart_byte){
		  case 'n':
			  have_instruction = 1;
			  uart_rx_buffer[uart_index] = '\0';
			  strncpy(instruction, uart_rx_buffer, sizeof(instruction));
			  uart_index = 0;
//			  OLED_ShowString(5, 45, "              ");
			  display_if_changed((char*)instruction);
			  HAL_UART_Transmit(&huart3, "ACK\r\n", 5, 0xFFFF);
			  break;

		  default:
			  if (uart_index < sizeof(uart_rx_buffer) - 1) {
				  uart_rx_buffer[uart_index++] = uart_byte;
				  uart_rx_buffer[uart_index] = '\0';
				  display_if_changed((char*)uart_rx_buffer);
			  }
			  break;
	  }

	  // ✅ Moved here so it always re-enables receive interrupt
	  HAL_UART_Receive_IT(&huart3, &uart_byte, 1);
  }
	//------------------------------------------------------------

}

void I2C_Bus_Recovery(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // 1. De-init I2C peripheral
    HAL_I2C_DeInit(&hi2c2);

    // 2. Configure SCL and SDA as GPIO outputs open-drain
    __HAL_RCC_GPIOB_CLK_ENABLE();  // Change port if your I2C2 pins are different

    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    GPIO_InitStruct.Pin = GPIO_PIN_10; // SCL (check your board)
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_11; // SDA (check your board)
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    // 3. Toggle SCL about 10 times while SDA is high
    for (int i = 0; i < 10; i++)
    {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, GPIO_PIN_SET);
        HAL_Delay(1);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, GPIO_PIN_RESET);
        HAL_Delay(1);
    }

    // 4. Generate a STOP condition manually
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, GPIO_PIN_RESET); // SDA low
    HAL_Delay(1);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, GPIO_PIN_SET);   // SCL high
    HAL_Delay(1);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, GPIO_PIN_SET);   // SDA high

    // 5. Re-init I2C peripheral
    MX_I2C2_Init();
}

void icm20948_init(void)
{
    uint8_t data;
    uint8_t who_am_i;

    I2C_Bus_Recovery();

    // Select bank 0 (just to be safe)
	data = 0x00;
	HAL_I2C_Mem_Write(&hi2c2, 0x68 << 1, 0x7F, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);

	// Read WHO_AM_I (0x00) - should be 0xEA
	HAL_I2C_Mem_Read(&hi2c2, 0x68 << 1, 0x00, I2C_MEMADD_SIZE_8BIT, &who_am_i, 1, 1000);
	if (HAL_I2C_Mem_Read(&hi2c2, 0x68<<1, 0x00, I2C_MEMADD_SIZE_8BIT, &who_am_i, 1, 1000) == HAL_OK) {
	    if (who_am_i == 0xEA) {
	        OLED_ShowString(95,35,"ok");
	    } else {
	        OLED_ShowString(95,35,"bad");
	    }
	} else {
	    OLED_ShowString(95,35,"i2c");
	}

    // Wake up
    data = 0x01;
    HAL_I2C_Mem_Write(&hi2c2, 0x68 << 1, 0x06, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);

    // Enable accel & gyro
    data = 0x00;
    HAL_I2C_Mem_Write(&hi2c2, 0x68 << 1, 0x07, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);

    // Disable ICM internal I2C master (required for BYPASS)
	data = 0x00; // USER_CTRL (0x03)
	HAL_I2C_Mem_Write(&hi2c2, 0x68<<1, 0x03, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);

	// Enable BYPASS so MCU can talk to AK09916 at 0x0C
	data = 0x02; // INT_PIN_CFG (0x0F): BYPASS_EN=1
	HAL_I2C_Mem_Write(&hi2c2, 0x68<<1, 0x0F, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);

	// Put AK09916 into continuous mode (e.g., 100 Hz)
	data = 0x08; // CNTL2 (0x31): 100 Hz
	HAL_I2C_Mem_Write(&hi2c2, 0x0C<<1, 0x31, I2C_MEMADD_SIZE_8BIT, &data, 1, 1000);
}


void PID_Compute(PID_Controller *pid, float error, float dt)
{
	// Integral term with anti-windup
	pid->integral += error * dt;
	if (pid->integral > INTEGRAL_MAX_MOTOR) pid->integral = INTEGRAL_MAX_MOTOR;
	if (pid->integral < -INTEGRAL_MAX_MOTOR) pid->integral = -INTEGRAL_MAX_MOTOR;

	// Derivative term
	float derivative = (error - pid->prevError) / dt;

	// PID output
	float output = pid->Kp * error
				 + pid->Ki * pid->integral
				 + pid->Kd * derivative;

	// Clamp to output range
	if (output > OUTPUT_MAX_MOTOR) output = OUTPUT_MAX_MOTOR;
	if (output < OUTPUT_MIN_MOTOR) output = OUTPUT_MIN_MOTOR;

	pid->pid_change = output;
	pid->prevError = error;
	pid->pwm_output += (int)output;
	if (pid->pwm_output > OUTPUT_MAX_MOTOR) pid->pwm_output = OUTPUT_MAX_MOTOR;
	if (pid->pwm_output < 0) pid->pwm_output = 0;

}



void forward(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		rotate_wheel(SERVO_LEFT);
		osDelay(800);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(800);
	}
	else osDelay(500);
	//-------------------------------------------------------

	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm + RPM_OFFSET) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//-----------------------------------------------------------


		//-------------------- Check distance travelled ------------------
		  if (distance_travelled >= target_distance){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void forward_until(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0.0f;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		rotate_wheel(SERVO_LEFT);
		osDelay(800);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(800);
	}
	else osDelay(500);
	//-------------------------------------------------------

