faris1702/SC2079-STM32-Robot/main.c
	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm + RPM_OFFSET) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------- End of Distance Calculation ------------------


		//-------------------- Check distance travelled ------------------
		  if (us_dist <= target_distance){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------


		  osDelay(delay);
	}
}

void reverse(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		rotate_wheel(SERVO_LEFT);
		osDelay(800);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(800);
	}
	else osDelay(500);
	//-------------------------------------------------------

	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------------------------------------------------------


		//-------------------- Check distance travelled ------------------
		  if (distance_travelled >= target_distance){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void reverse_until(float target_rpm, float target_distance, int delay){
	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	distance_travelled = 0.0f;
	total_left_encoder = 0;

	//-------------- Front tire correction ------------------
	if (servo_prev != SERVO_LEFT){
		rotate_wheel(SERVO_LEFT);
		osDelay(800);
		rotate_wheel(SERVO_MIDDLE);
		osDelay(800);
	}
	//-------------------------------------------------------

	for (;;){
		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;
		  error_right_rpm = (target_rpm) - motor_right_rpm;

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//-------------- Distance Calculation ----------------------
		  total_revolution = total_left_encoder / 1525.0f;  //1320 OR 1405
		  distance_travelled = total_revolution * 20.41f;  // wheel circumference = 20.736 OR 20.41,

		  total_revolution_int = total_revolution;
		  distance_travelled_int = distance_travelled;
		//----------------------------------------------------------


		//-------------------- Check distance travelled ------------------
		  if (us_dist >= target_distance){
			  MotorStop_both();
			  break;
		  }
		//-----------------------------------------------------------------

		  osDelay(delay);
	}
}

void forwardTurn(int dir, float target_angle, float target_rpm, int delay){
	//-------------------- Servo Init -----------------------
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	if (dir == LEFT){
		htim12.Instance->CCR1 = SERVO_LEFT;
		servo_prev = SERVO_LEFT;
	}
	else{
		htim12.Instance->CCR1 = SERVO_RIGHT;
		servo_prev = SERVO_RIGHT;
	}
	//--------------------------------------------------------

	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.0f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.0f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(1);
	//--------------------------------------------------------

	osDelay(500);
	prev_angle_direction = 0.0f;
	angle_direction = 0.0f;


	for (;;){
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  if (dir == RIGHT){
			  error_left_rpm = (target_rpm) - motor_left_rpm;          //60rpm
			  error_right_rpm = (target_rpm-25.0f) - motor_right_rpm;  //40rpm
		  }
		  else{
			  error_left_rpm = (target_rpm-25.5f) - motor_left_rpm;
			  error_right_rpm = (target_rpm) - motor_right_rpm;
		  }

