faris1702/SC2079-STM32-Robot/main.c
		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
		  if ((error_angle) <= 0.0f){
			  MotorStop_both();
			  osDelay(500);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

void reverseTurn(int dir, float target_angle, float target_rpm, int delay){
	//-------------------- Servo Init -----------------------
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	if (dir == LEFT){
		htim12.Instance->CCR1 = SERVO_LEFT;
		servo_prev = SERVO_LEFT;
	}
	else{
		htim12.Instance->CCR1 = SERVO_RIGHT;
		servo_prev = SERVO_RIGHT;
	}
	//--------------------------------------------------------

	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.5f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.5f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	osDelay(500);
	prev_angle_direction = 0.0f;
	angle_direction = 0.0f;

	for (;;){
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  error_left_rpm = (target_rpm) - motor_left_rpm;         //60rpm
		  error_right_rpm = (target_rpm-22.5f) - motor_right_rpm; //40rpm

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
		  if ((error_angle) <= 0.0f){
			  MotorStop_both();
			  osDelay(500);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

int request_RPI(void){
	sprintf(buffer, "IMG\r\n");
	HAL_UART_Transmit(&huart3, buffer, strlen(buffer), 0xFFFF);
	for (;;){
		osDelay(10);
		if (have_instruction){
			switch (uart_byte){
				case 'y': //image detected
					have_instruction = 0;
					return 1;
				case 'n':
					have_instruction = 0;
					return 0;
				default:
					have_instruction = 0;
					return 0;
			}
		}
	}
}

void buzzerOn(int delay){
	HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_8);
	osDelay(delay);
	HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_8);
}

void rotate_wheel(int side){
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	htim12.Instance->CCR1 = side;
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  for(;;)
  {

	// Toggle LED every 1s to show that STM not stuck in loop and still running
	HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
	osDelay(1000);

  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_show */
/**
* @brief Function implementing the ShowTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_show */
void show(void *argument)
{
  /* USER CODE BEGIN show */
	char buffer[20];

  /* Infinite loop */
  for(;;)
  {
	  sprintf(buffer, "Motor L:%2d R:%2d", motor_left_rpm_int, motor_right_rpm_int);
	  OLED_ShowString(5, 5, buffer);

	  sprintf(buffer, "Dist:%4d", distance_travelled_int);
	  OLED_ShowString(5, 15, buffer);

	  sprintf(buffer, "IR L:%2d R:%2d", ir_dist_left_int, ir_dist_right_int);
	  OLED_ShowString(5, 25, buffer);

	  sprintf(buffer, "US:%3d", us_dist_int);
	  OLED_ShowString(5, 35, buffer);

//	  sprintf(buffer, "Angle:%3d", gyro_z_dps_int);
//	  sprintf(buffer, "%04d-\0", pid_right.pwm_output);
//	  sprintf(buffer, "%04d--", encoder_difference);
//	  OLED_ShowString(5, 45, buffer);


	// Refreshes the OLED screen every 0.5s
	// This is the only refresh function call in all the tasks
	OLED_Refresh_Gram();

    osDelay(250);
  }
  /* USER CODE END show */
}

/* USER CODE BEGIN Header_motors */
/**
* @brief Function implementing the MotorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_motors */
void motors(void *argument)
{
  /* USER CODE BEGIN motors */

	int flag = 0;
	int count = 0;
	int image_check;
	int start = 0;


	//---------- Starting ----------
	//start only when user button pressed
	osDelay(1000);//delay for ultrasonic init
	for (;;){
		osDelay(10);
		if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == RESET){
			break;
		}
	}
//	forward_until(60.0f, 15.0f, 40);
	//-------------------------------

	//currently, diameter = 63~65
	forwardTurn(LEFT, 180.0f, 60.0f, 40);
  /* Infinite loop */
  for(;;)
  {

	  //***** Un-comment to stop *****
	  osDelay(1000);
	  continue;
	  //*****************************

	  //------------- Checklist (Movement around object) ------------------------
	  if (flag){
		  osDelay(1000);
		  continue;
	  }

	  osDelay(3000); //Time delay to recognise image

	  reverse(60.0f, 20.0f, 40);
	  osDelay(1000);

	  forwardTurn(LEFT, 45.0f, 60.0f, 40);
	  osDelay(1000);
	  forwardTurn(RIGHT, 45.0f, 60.0f, 40);
	  osDelay(1000);

