faris1702/SC2079-STM32-Robot/main.c
  }
  /* USER CODE END ultra_sensor */
}

/* USER CODE BEGIN Header_sensor_reading */
/**
* @brief Function implementing the sensorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_sensor_reading */
void sensor_reading(void *argument)
{
  /* USER CODE BEGIN sensor_reading */
	uint8_t reg_addr = 0x37;    // start from GYRO_ZOUT_H
	uint8_t rawData[2];         // to store MSB and LSB
	float B = 0.9f;

	int16_t drift_raw, drift_total=0;
	float drift_degrees;

	int delay = 10;
	float dt;
	double offset = 0;
	double trash = 0;
	int i = 0;
	uint32_t tick1, tick2;

	icm20948_init();
	osDelay(100); //delay to make sure ICM 20948 power up

	tick1 = HAL_GetTick();

	while (i < 1000){
		osDelay(1);
		HAL_I2C_Master_Transmit(&hi2c2, 0x68 << 1, &reg_addr, 1, 1000);
		HAL_I2C_Master_Receive(&hi2c2, 0x68 << 1, rawData, 2, 1000);
		drift_raw = (int16_t)((rawData[0] << 8) | rawData[1]);
		offset += drift_raw;
		tick1 = HAL_GetTick();
		i++;
	}
	offset = offset/i;


	tick1 = HAL_GetTick();
  /* Infinite loop */
  for(;;)
  {
	//------------------- Gyroscope Readings ---------------------------------------
	// Step 1: Tell sensor which register to read
	if(HAL_I2C_Master_Transmit(&hi2c2, 0x68 << 1, &reg_addr, 1, 1000)!= HAL_OK){
		OLED_ShowString(5, 5, "0");
	}

	// Step 2: Read 2 bytes (MSB + LSB)
	if (HAL_I2C_Master_Receive(&hi2c2, 0x68 << 1, rawData, 2, 1000)!=HAL_OK){
		OLED_ShowString(5, 5, "1");
	}
	// Combine into signed 16-bit value
	gyro_z_raw = (int16_t)((rawData[0] << 8) | rawData[1]);
	gyro_z_raw -= offset;
	gyro_z_dps = gyro_z_raw / 131.0f;
	gyro_z_dps_int = gyro_z_dps;
	// -----------------------------------------------------------------------------

	//-------------------- Angle Calculation -----------------------
	tick2 = HAL_GetTick();
	dt = (tick2-tick1) / 1000.0f;
	angle_direction = prev_angle_direction + (gyro_z_dps * dt);
	prev_angle_direction = angle_direction;
	angle_direction_int = angle_direction;
	//--------------------------------------------------------------

	tick1 = tick2;

	osDelay(1);
  }
  /* USER CODE END sensor_reading */
}

/* USER CODE BEGIN Header_ir_dist */
/**
* @brief Function implementing the IRDistTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_ir_dist */
void ir_dist(void *argument)
{
  /* USER CODE BEGIN ir_dist */

  /* Infinite loop */
  for(;;)
  {
	// ---------------- IR Sensor Left Readings ------------------------
	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 20);
	ir_raw_left = HAL_ADC_GetValue(&hadc1);
	HAL_ADC_Stop(&hadc1);

	//  40483.4058f / (raw + 50.8020f) - 4.6692f;
	ir_dist_left = (40483.4058f / (ir_raw_left + 50.8020f)) - 4.6692f;
	if (ir_dist_left > 40.0f) ir_dist_left = 40.0;
	if (ir_dist_left < 0.0f) ir_dist_left = 0.0f;
	ir_dist_left_int = ir_dist_left;
	// -------------------------------------------------------------------

	// ------------------ IR Sensor Right Readings  -----------------------
	HAL_ADC_Start(&hadc2);
	HAL_ADC_PollForConversion(&hadc2, 20);
	ir_raw_right = HAL_ADC_GetValue(&hadc2);
	HAL_ADC_Stop(&hadc2);

	// 44430.9618f / (raw + 109.84988f) - 5.72134f;
	ir_dist_right = (44430.9618f / (ir_raw_right + 109.84988f)) - 5.72134f;
	if (ir_dist_right > 40.0f) ir_dist_right = 40.0;
 	if (ir_dist_right < 0.0f) ir_dist_right = 0.0f;
	ir_dist_right_int = ir_dist_right;
	//---------------------------------------------------------------------


    osDelay(200);
  }
  /* USER CODE END ir_dist */
}

/* USER CODE BEGIN Header_transmit */
/**
* @brief Function implementing the transmitTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_transmit */
void transmit(void *argument)
{
  /* USER CODE BEGIN transmit */
  char sbuf[64];
  int target_rpm = 60;

  /* Infinite loop */
  for(;;)
  {

	  //--------------------------------------------- Motor ------------------------------------------
//	  sprintf(sbuf, "%2d,%2d,%3d,%3d,%2d,%7d,0\r\n", motor_left_rpm_int, motor_right_rpm_int,
//			  	  	  	  	  	  	  	  	  motor_left_rpm_lpf_int, motor_right_rpm_lpf_int, target_rpm,
//											  encoder_difference);

//	  sprintf(sbuf, "%5d,100\r\n", distance_travelled_int);

//	  sprintf(sbuf, "%2d,%2d,%3d,%3d,%2d,%4d,%4d,0\r\n", motor_left_rpm_int, motor_right_rpm_int,
//			  	  	  	  	  	  	  	  	  (int)error_left_rpm, (int)error_right_rpm, target_rpm,
//	  	  	  	  	  	  	  	  	  	  	  pid_left.pwm_output, pid_right.pwm_output);
	  //-----------------------------------------------------------------------------------------------

	  //------------------------------- Turning Motion ----------------------------------------------
//	  sprintf(sbuf, "%2d,%3d\r\n", error_angle, angle_direction_hpf_int);
	  //---------------------------------------------------------------------------------------------

	  //------------------------------ Gyroscope readings -------------------------------------
//	  sprintf(sbuf, "%5d,%3d,%3d,%3d,90\r\n", gyro_z_raw, gyro_z_dps_int, angle_direction_int, error_angle_int);
	  //---------------------------------------------------------------------------------------

	  //----------------------- IR Distance / UART w RPi -------------------------------
//	  sprintf(sbuf, "%02d,%02d,%03d\r\n", ir_dist_left_int, ir_dist_right_int, us_dist_int);
	  //--------------------------------------------------------------------------------

//	  HAL_UART_Transmit(&huart3, sbuf, strlen(sbuf), 0xFFFF);

    osDelay(200);
  }
  /* USER CODE END transmit */
}

/* USER CODE BEGIN Header_encoder_diff */
/**
* @brief Function implementing the encoderDiffTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder_diff */
void encoder_diff(void *argument)
{
  /* USER CODE BEGIN encoder_diff */
	int left, right;
  /* Infinite loop */
  for(;;)
  {
    left = 65535 - __HAL_TIM_GET_COUNTER(&htim3);
	right = __HAL_TIM_GET_COUNTER(&htim2);
	encoder_difference = left - right;

	osDelay(20);
  }
  /* USER CODE END encoder_diff */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
